fsi-workflow/04_fluidSimulation/solution_water_Re20000/Fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "0.003/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       1264120;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       1264184;
    }
    far
    {
        type            slip;
        inGroups        1(slip);
        nFaces          480;
        startFace       1264248;
        faces           ( ( 1 5 4 0 ) ( 4 5 6 7 ) ( 3 7 6 2 ) );
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2103;
        startFace       1264728;
    }
    naca2312
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52860;
        startFace       1266831;
    }
)

// ************************************************************************* //
